In [ ]:
## IMPORTING PANDAS

In [1]:
import pandas as pd

In [3]:
data = {"Name": ["John", "Mary", "Bob", "Sarah", "Tom", "Lisa"], 
                 "Department": ["IT", "Marketing", "Sales", "IT", "Finance", "Marketing"],
                 "Age": [30, 40, 25, 35, 45, 28],
                 "Gender": ["Male", "Female", "Male", "Female", "Male", "Female"],
                 "Salary": [50000, 60000, 45000, 55000, 70000, 55000],
                 "Experience" : [3, 7, 2, 5, 10, 4]}

In [ ]:
## CONVERTING DATA TO A DATAFRAME

In [5]:
data_df = pd.DataFrame(data)

In [7]:
data_df

    Name Department  Age  Gender  Salary  Experience
0   John         IT   30    Male   50000           3
1   Mary  Marketing   40  Female   60000           7
2    Bob      Sales   25    Male   45000           2
3  Sarah         IT   35  Female   55000           5
4    Tom    Finance   45    Male   70000          10
5   Lisa  Marketing   28  Female   55000           4

In [9]:
## USE THE iloc TO SELECT THE FIRST 3 ROWS OF THE DATAFRAME

In [11]:
data_df.iloc[:3, :6]

   Name Department  Age  Gender  Salary  Experience
0  John         IT   30    Male   50000           3
1  Mary  Marketing   40  Female   60000           7
2   Bob      Sales   25    Male   45000           2

In [13]:
## USE the iloc SELECT ALL ROWS WHERE THE DEPARTMENT IS MARKETING

In [39]:
data_df.loc[data_df ["Department"] == "Marketing"]

   Name Department  Age  Gender  Salary  Experience
1  Mary  Marketing   40  Female   60000           7
5  Lisa  Marketing   28  Female   55000           4

In [17]:
## USE THE iloc METHODS TO SELECT THE AGE AND GENDER COLUMN FOR THE FIRST 4 ROWS OF THE DATAFRAME

In [25]:
data_df.iloc[:4, 2:4]

   Age  Gender
0   30    Male
1   40  Female
2   25    Male
3   35  Female

In [27]:
## USE THE loc TO SELECT THE SALARY AND EXPERIENCE COLUMN FOR ALL ROWS WHERE THE GENDER IS MALE

In [29]:
data_df.loc[:, ["Salary", "Experience"]]

   Salary  Experience
0   50000           3
1   60000           7
2   45000           2
3   55000           5
4   70000          10
5   55000           4